_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПлощадиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПлощадиОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ЦеныОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ЦеныОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыОперацийСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаЕдиницуПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыРасчетовСПартнерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыРасчетовСПартнерами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКредитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСДебитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСЛизингодателем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/УПН_ОбщиеПроцедуры/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОбщуюПлощадьПоОбъектуНедвижимости(ОбъектНедвижимости, Период = '00010101') Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), КонецДня(Период), Период));
	Запрос.УстановитьПараметр("ОбъектНедвижимости", ОбъектНедвижимости);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь
	|ИЗ
	|	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(&Период, ОбъектНедвижимости = &ОбъектНедвижимости) КАК ПлощадиОбъектовНедвижимости";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОбщаяПлощадь;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦенуПоОбъектуНедвижимости(ОбъектНедвижимости,ВидЦены,ТипОперации,Валюта, Период = '00010101') Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), КонецДня(Период), Период));
	Запрос.УстановитьПараметр("ОбъектНедвижимости", ОбъектНедвижимости);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ТипОперации", ТипОперации);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УПН_ЦеныОбъектовНедвижимостиСрезПоследних.ЦенаЗаЕдиницуПлощади КАК ЦенаЗаЕдиницуПлощади
	|ИЗ
	|	РегистрСведений.УПН_ЦеныОбъектовНедвижимости.СрезПоследних(
	|			&Период,
	|			ОбъектНедвижимости = &ОбъектНедвижимости
	|				И ТипОперации = &ТипОперации
	|				И ВидЦены = &ВидЦены
	|				И Валюта = &Валюта) КАК УПН_ЦеныОбъектовНедвижимостиСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЦенаЗаЕдиницуПлощади;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура УПН_ОбщиеПроцедуры(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УПН_РасторжениеСделкиПоНедвижимости")
		И ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеЗадолженности") Тогда
		
		Источник.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности;
		Источник.Организация		= ДанныеЗаполнения.Организация;
		Источник.Контрагент = ДанныеЗаполнения.Контрагент;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.ОбъектыНедвижимости Цикл
			
			Если НЕ ТекСтрока.Санкции Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Источник.Задолженность.Добавить();
			НоваяСтрока.ТипРасчетов 			= Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
			НоваяСтрока.Партнер					= ДанныеЗаполнения.Партнер;
			НоваяСтрока.Заказ 					= ДанныеЗаполнения.Договор;
			НоваяСтрока.Сумма 					= ТекСтрока.Санкции;
			НоваяСтрока.ВалютаВзаиморасчетов 	= ДанныеЗаполнения.Договор.ВалютаВзаиморасчетов;
			
		КонецЦикла;
		
	КонецЕсли;			
	
КонецПроцедуры

#КонецОбласти
